reivax-boucoi/BE_Auto/UsurF/PMSM_TGN002_cde_FOC/src/DSPIConfig.c
/*
 * DSPIConfig.c
 *
 *  Created on: 21 août 2018
 *      Author: admin_aboyer
 *
 *  Configuration et utilisation des modules DSPI (Serial Peripheral Interface)
 */


#include "MPC5744P.h"
#include "DSPIConfig.h"
#include "ConfigGPIO.h"
#include "pga411.h"


/*****************************************************************************/
/* Halt_All_DSPI_modules                                                     */
/* Description: configure les pads d'IO associés à DSPI0                     */
/*****************************************************************************/
void Halt_All_DSPI_modules(void) {
	DSPI_Enter_Exit_HaltMode(Module_DSPI0,Stop_DSPI_Transfer);
	DSPI_Enter_Exit_HaltMode(Module_DSPI1,Stop_DSPI_Transfer);
	DSPI_Enter_Exit_HaltMode(Module_DSPI2,Stop_DSPI_Transfer);
	DSPI_Enter_Exit_HaltMode(Module_DSPI3,Stop_DSPI_Transfer);
}

/*****************************************************************************/
/* init_dspi0_ports                                                          */
/* Description: configure les pads d'IO associés à DSPI0                     */
/*****************************************************************************/
void init_dspi0_ports(void) {
	  /* Master - DSPI_0 */
	  SIUL2.MSCR[PC6].B.SSS = 1;                 /* Pad PC6: Source signal is DSPI_0 SOUT  */
	  SIUL2.MSCR[PC6].B.OBE = 1;                 /* Pad PC6: OBE=1. */
	  SIUL2.MSCR[PC6].B.SRC = 3;                 /* Pad PC6: Full strength slew rate */

	  SIUL2.MSCR[PC5].B.SSS = 1;                /* Pad PC5: Source signal is DSPI_0 CLK  */
	  SIUL2.MSCR[PC5].B.OBE = 1;                /* Pad PC5: OBE=1. */
	  SIUL2.MSCR[PC5].B.SRC = 3;                /* Pad PC5: Full strength slew rate */

	  SIUL2.MSCR[PC7].B.IBE = 1;                /* Pad PC7: Enable pad for input DSPI_0 SIN */
	  SIUL2.IMCR[41].B.SSS = 1;            		/* Pad PC7: connected to pad PC7 */

	  SIUL2.MSCR[PC4].B.SSS = 1;                 /* Pad PC4: Source signal is DSPI_0 CS0  */
	  SIUL2.MSCR[PC4].B.OBE = 1;                 /* Pad PC4: OBE=1. */
	  SIUL2.MSCR[PC4].B.SRC = 3;                 /* Pad PC4: Full strength slew rate */
}

/*****************************************************************************/
/* init_dspi1_ports                                                                 */
/* Description: configure les pads d'IO associés à DSPI1         */
/*****************************************************************************/
void init_dspi1_ports(void) {
	  /* Master - DSPI_1 */
	  SIUL2.MSCR[PA7].B.SSS = 1;                 /* Pad PA7: Source signal is DSPI_1 SOUT  */
	  SIUL2.MSCR[PA7].B.OBE = 1;                 /* Pad PA7: OBE=1. */
	  SIUL2.MSCR[PA7].B.SRC = 3;                 /* Pad PA7: Full strength slew rate */

	  SIUL2.MSCR[PA6].B.SSS = 1;                /* Pad PA6: Source signal is DSPI_1 CLK  */
	  SIUL2.MSCR[PA6].B.OBE = 1;                /* Pad PA6: OBE=1. */
	  SIUL2.MSCR[PA6].B.SRC = 3;                /* Pad PA6: Full strength slew rate */

	  SIUL2.MSCR[PA8].B.IBE = 1;                /* Pad PA8: Enable pad for input DSPI_1 SIN */
	  SIUL2.IMCR[44].B.SSS = 1;            		/* Pad PA8: connected to pad PA8 */

	  SIUL2.MSCR[PA5].B.SSS = 1;                 /* Pad PA5: Source signal is DSPI_1 CS0  */
	  SIUL2.MSCR[PA5].B.OBE = 1;                 /* Pad PA5: OBE=1. */
	  SIUL2.MSCR[PA5].B.SRC = 3;                 /* Pad PA5: Full strength slew rate */
}


/*****************************************************************************/
/* init_dspi2_ports                                                                 */
/* Description: configure les pads d'IO associés à DSPI2         */
/*****************************************************************************/
void init_dspi2_ports(void) {
	  SIUL2.MSCR[PIN_DSPI2_SCK].B.SSS = 2;                /* Pad PA0: DSPI2_SCLK */
	  SIUL2.MSCR[PIN_DSPI2_SCK].B.OBE = 1;                /* Pad PA0: OBE=1. */
	  SIUL2.MSCR[PIN_DSPI2_SCK].B.SRC = 3;                /* Pad PA0: Full strength slew rate */

	  SIUL2.MSCR[PIN_DSPI2_SOUT].B.SSS = 2;                /* Pad PA1: DSPI_2 SOUT */
	  SIUL2.MSCR[PIN_DSPI2_SOUT].B.OBE = 1;                /* Pad PA1: OBE=1. */
	  SIUL2.MSCR[PIN_DSPI2_SOUT].B.SRC = 3;                /* Pad PA1: Full strength slew rate */

	  SIUL2.MSCR[PIN_DSPI2_SIN].B.IBE = 1;                /* Pad PA2: EDSPI_2 SIN */
	  SIUL2.IMCR[47].B.SSS = 2;            /* Pad PA2: connected to pad */

	  SIUL2.MSCR[PIN_DSPI2_NCS3].B.SSS = 2;                 /* Pad PA3: DSP2_ CS3  */
	  SIUL2.MSCR[PIN_DSPI2_NCS3].B.OBE = 1;                 /* Pad PA5: OBE=1. */
	  SIUL2.MSCR[PIN_DSPI2_NCS3].B.SRC = 3;                 /* Pad PA5: Full strength slew rate */
}

/*****************************************************************************/
/* init_dspi0                                                                 */
/* Description: configure les propriétés générale de DSPI0 (sauf propriétés temporelles)     */
/*****************************************************************************/
void init_dspi0(void) {
	/* Configure DSPI_1 as master, CS0 active at low state, stop transfers */
	SPI_0.MCR.B.HALT = Stop_DSPI_Transfer;
	SPI_0.MCR.B.MDIS = Enable_SPI_clock;
	SPI_0.MCR.B.MSTR = Master_Mode;
	SPI_0.MCR.B.PCSIS = Inactive_CS_High << (CS0_Asserted-1); //état actif = état bas -->
					//état inactif = état haut
	SPI_0.MCR.B.DIS_TXF = Enable_SPI_TX_FIFO;
	SPI_0.MCR.B.DIS_RXF = Enable_SPI_RX_FIFO;
	SPI_0.MCR.B.CONT_SCKE = 0; //Continuous SCK disabled.
}

/*****************************************************************************/
/* init_dspi1                                                                 */
/* Description: configure les propriétés générale de DSPI1 (sauf propriétés temporelles)     */
/*****************************************************************************/
void init_dspi1(void) {
	/* Configure DSPI_1 as master, CS0 active at low state, stop transfers */
	SPI_1.MCR.B.HALT = Stop_DSPI_Transfer;
	SPI_1.MCR.B.MDIS = Enable_SPI_clock;
	SPI_1.MCR.B.MSTR = Master_Mode;
	SPI_1.MCR.B.PCSIS = Inactive_CS_High << (CS0_Asserted-1); //état actif = état bas -->
					//état inactif = état haut
	SPI_1.MCR.B.DIS_TXF = Enable_SPI_TX_FIFO;
	SPI_1.MCR.B.DIS_RXF = Enable_SPI_RX_FIFO;
	SPI_1.MCR.B.CONT_SCKE = 0; //Continuous SCK disabled.
}

/*****************************************************************************/
/* init_dspi2                                                                 */
/* Description: configure les propriétés générale de DSPI2 (sauf propriétés temporelles)     */
/*****************************************************************************/
void init_dspi2(void) {
	/* Configure DSPI_2 as master, CS3 active at low state, stop transfers */
	SPI_2.MCR.B.HALT = Stop_DSPI_Transfer;
	SPI_2.MCR.B.MDIS = Enable_SPI_clock;
	SPI_2.MCR.B.MSTR = Master_Mode;
	SPI_2.MCR.B.PCSIS = Inactive_CS_High*CS3_Asserted;  //état actif = état bas -->
	//état inactif = état haut. Ce champ est ignoré quand le module est esclave (CS actif à l'état bas).
	SPI_2.MCR.B.DIS_TXF = Enable_SPI_TX_FIFO;
	SPI_2.MCR.B.DIS_RXF = Enable_SPI_RX_FIFO;
	SPI_2.MCR.B.CONT_SCKE = 0; //Continuous SCK disabled.
}

/*****************************************************************************/
/* SetTiming_dspi0                                                                 */
/* Description: configure les paramètres temporelles associés au registre CTAR[CTAR_nb] de DSPI0     */
/* Le GD3000 impose que la donnée Sout change sur le front montant de SCK et soit échantillonné
 * sur front descendant de SCK --> CPOL = 0 et CPHA = 1
 */
/*****************************************************************************/
void SetTiming_dspi0(uint8_t CTAR_nb) {
	/*Configure Clock and transfer attributes */

	SPI_0.MODE.CTAR[CTAR_nb].B.FMSZ = 0x7; //frame size = 8 bits --> FMSZ = 8-1 = 7
	SPI_0.MODE.CTAR[CTAR_nb].B.CPOL = Inactive_SCLK_Low;
	SPI_0.MODE.CTAR[CTAR_nb].B.CPHA = 1; //0;
	SPI_0.MODE.CTAR[CTAR_nb].B.LSBFE = MSB_First;

	//config baud rate
	//Baud rate = Fsys/PBR*(1+DBR)/BR
	//With Fsys = 50 MHz and DBR = 0, PBR = 3 (0b01), BR = 128 (0b0111)
	// --> Baud Rate = 50M/3*(1+0)/128 = 130.21 kBds
	SPI_0.MODE.CTAR[CTAR_nb].B.DBR = Normal_DR;
	SPI_0.MODE.CTAR[CTAR_nb].B.PBR = 0b01; //(=Prescaler_Baud_Rate = 3), prescaler value for the baud rate
	SPI_0.MODE.CTAR[CTAR_nb].B.BR = 0b0111; //(128), baud rate scaler: SCK baud rate = Fsys/PBR*(1+DBR)/BR

	//Config delay between PCS and SCK signals
	//Delay between PCS and SCK signals (from assertion of the CS_x signal to the first SCK_x edge):
	//Tcsc = 1/Fsys*PCSSCK*CSSCK
	//With Fsys = 50M, PCSSCK = 1 (0b00) and CSSCK = 64 (0b0101)
	// --> Tcsc = 1/50M*1*64 = 1.28 µs
	SPI_0.MODE.CTAR[CTAR_nb].B.PCSSCK = 0b00; //(=1), prescaler value for delay between CS assertion and clk first edge
	SPI_0.MODE.CTAR[CTAR_nb].B.CSSCK = 0b0101; //(=64), scaler value for the PCS to SCK delay: Tcsc = 1/Fsys*PCSSCK*CSSCK

	//Config after SCK delay:
	//Delay between last edge of SCK and negation of CS (after SCK delay):
	//Tasc = 1/Fsys*PASC*ASC
	//With Fsys = 50 M, PASC = 1 (0b00) and ASC = 64 (0b0101)
	// --> Tasc = 1/50M*1*32 = .28 µs
	SPI_0.MODE.CTAR[CTAR_nb].B.PASC = 0b00; //(=1), prescaler value for delay between clk last edge and negation of CS
	SPI_0.MODE.CTAR[CTAR_nb].B.ASC = 0b0101; //(=64), scaler value for the After SCK Delay: Tasc = 1/Fsys*PASC*CASC

