reivax-boucoi/BE_Auto/UsurF/PMSM_TGN002_cde_FOC/src/DSPIConfig.c
	return(ReceivedData);
}


/*****************************************************************************/
/* Transmit_Read_8bits_DSPI                                                             */
/* Description: la fonction fait transmettre par le maitre une trame 8 bits et récupère une
 * trame sur 16 bits (réponse de l'esclave).
 */
/*****************************************************************************/
uint32_t Transmit_Read_DSPI_8bits(uint8_t Module_nb, uint8_t MasterSlave, uint8_t CTAR_nb, uint8_t PCS_nb,
		uint8_t Message, uint8_t CS_Cont,uint32_t EOQ) {
	uint32_t ReadData;

	Transmit_DSPI_8bits(Module_nb,MasterSlave,CTAR_nb,PCS_nb,Message,CS_Cont,EOQ);
	ReadData = Read_DSPI(Module_nb);
	return(ReadData);
}


/*****************************************************************************/
/* Transmit_Read_DSPI                                                             */
/* Description: la fonction fait transmettre par le maitre une trame 16 bits et récupère une
 * trame sur 16 bits (réponse de l'esclave).
 */
/*****************************************************************************/
uint32_t Transmit_Read_DSPI(uint8_t Module_nb, uint8_t MasterSlave, uint8_t CTAR_nb, uint8_t PCS_nb,
		uint16_t Message, uint8_t CS_Cont,uint32_t EOQ) {
	uint32_t ReadData;

	Transmit_DSPI(Module_nb,MasterSlave,CTAR_nb,PCS_nb,Message,CS_Cont,EOQ);
	ReadData = Read_DSPI(Module_nb);
	return(ReadData);
}


/*****************************************************************************/
/* Transmit_Read_DSPI_32bits                                                             */
/* Description: la fonction fait transmettre par le maitre une trame 32 bits et récupère une
 * trame sur 32 bits.
 */
/*****************************************************************************/
uint32_t Transmit_Read_DSPI_32bits(uint8_t Module_nb, uint8_t MasterSlave, uint8_t CTAR_nb, uint8_t PCS_nb,uint32_t MessageTX) {
	uint16_t MessageTX1, MessageTX2;
	uint16_t MessageRX1, MessageRX2;
	uint32_t MessageRX = 0;

	//extraction des 2 mots de 16 bits du message. On transmet d'abord le MSB.
	MessageTX2 = (uint16_t)(0x0000FFFF & MessageTX); //LSB
	MessageTX1 = (uint16_t)(0x0000FFFF & (MessageTX >> 16)); //MSB

   	Transmit_DSPI(Module_nb,MasterSlave,CTAR_nb,PCS_nb,MessageTX1,CS_Cont_ON,0);
   	Transmit_DSPI(Module_nb,MasterSlave,CTAR_nb,PCS_nb,MessageTX2,CS_Cont_OFF,0);

   	//read received data through SPI
   	MessageRX1 = Read_DSPI(Module_nb);
   	MessageRX2 = Read_DSPI(Module_nb);

	MessageRX = (MessageRX1 << 16) | MessageRX2;

	return(MessageRX);
}


